("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє куяєвσт ву кяyкєηz ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
/*
╔⧉༻ [ 𝐕𝐥𝐤𝐲𝐫𝐞🕊️𝐌𝐮𝐥𝐭𝐢𝐃𝐞𝐯𝐢𝐜𝐞 𝐀𝐏𝐈 ] 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
║ 🐞𝐃𝐞𝐯𝐞𝐥𝐨𝐩𝐞𝐫𝐬 +918436686758,917430922909
║ 
║ We won't be responsible for any kind of ban due to this bot.
║ νℓкуяє was made for fun purpose and to make group management easier.
║ It's your concern if you spam and gets your account banned.
║ Also, Forks won't be entertained.
║ If you fork this repo and edit plugins, it's your concern for further updates.
║ Forking Repo is fine. But if you edit something we will not provide any help.
║ In short, Fork At Your Own Risk.
╚════════════╝
*/
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє куяєвσт ву кяyкєηz ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
module.exports = async (νℓкуяє, vcнaт, update) => {
  console.log(
    "\n◎✕———————————————————————✕ νℓкуяє куяєвσт ву кяyкєηz ✕———————————————————————✕◎"
  );
  console.log(
    νℓкуяє.chalk.blueBright("       🖊️ 𝐂𝐨𝐦𝐦𝐚𝐧𝐝: "),
    νℓкуяє.chalk.green(νℓкуяє.budy || νℓкуяє.mtype)
  );
  console.log(
    νℓкуяє.chalk.blueBright("       ❣️ 𝐔𝐬𝐞𝐫-𝐍𝐚𝐦𝐞: "),
    νℓкуяє.chalk.green(νℓкуяє.pushname)
  );
  console.log(
    νℓкуяє.chalk.blueBright("       📱 𝐔𝐬𝐞𝐫-𝐍𝐮𝐦𝐛𝐞𝐫: "),
    νℓкуяє.chalk.green(vcнaт.sender)
  );
  console.log(
    νℓкуяє.chalk.blueBright("       💬 𝐂𝐡𝐚𝐭-𝐈𝐝: "),
    νℓкуяє.chalk.green(vcнaт.chat)
  );
  console.log(
    "◎✕———————————————————————✕ νℓкуяє куяєвσт ву кяyкєηz ✕———————————————————————✕◎\n"
  );
  ("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє куяєвσт ву кяyкєηz ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
  switch (νℓкуяє.command) {
    case "vlkyre":
      куяєвσт = require("../Plugins/vlkyre");
      break;
    case "play":
      куяєвσт = require("../Plugins/𝘋𝘰𝘸𝘯𝘭𝘰𝘢𝘥📥𝘫𝘴/youtube");
      куяєвσт(νℓкуяє, vcнaт);
      break;

    case "bite":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/bite");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "blush":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/blush");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "bonk":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/bonk");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "bored":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/bored");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "confused":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/confused");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "cry":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/cry");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "cuddle":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/cuddle");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "dance":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/dance");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "goodnight":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/goodnight");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "happy":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/happy");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "highfive":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/highfive");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "hug":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/hug");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "kick":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/kick");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "kill":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/kill");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "kiss":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/kiss");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "nervous":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/nervous");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "pat":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/pat");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "poke":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/poke");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "punch":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/punch");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "sad":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/sad");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "scream":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/scream");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "slap":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/slap");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "smile":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/smile");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "stare":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/stare");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "wave":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/wave");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "wink":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/wink");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "yeet":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/yeet");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "yes":
      куяєвσт = require("../Plugins/𝘈𝘯𝘪𝘮𝘦🐉𝘫𝘴/yes");
      куяєвσт(νℓкуяє, vcнaт);
      break;

    case "h.anime":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_anime");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.download":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_download");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.filter":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_filter");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.game":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_game");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.group":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_group");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.hentai":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_hentai");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.image":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_image");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.search":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_search");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "h.ytfilter":
      куяєвσт = require("../Plugins/𝘊𝘰𝘮𝘮𝘢𝘯𝘥💗𝘫𝘴/_ytfilter");
      куяєвσт(νℓкуяє, vcнaт);
      break;

    case "bassboost":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/bassboost");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "echo":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/echo");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "flanger":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/flanger");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "nightcore":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/nightcore");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "phaser":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/phaser");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "reverse":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/reverse");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "slow":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/slow");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "speed":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/speed");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "subboost":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/subboost");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "superslow":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/superslow");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "superspeed":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/superspeed");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "surround":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/surround");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "vaporwave":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/vaporwave");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "vibrato":
      куяєвσт = require("../Plugins/𝘍𝘪𝘭𝘵𝘦𝘳📢𝘑𝘴/vibrato");
      куяєвσт(νℓкуяє, vcнaт);
      break;

    case "ytbassboost":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytbassboost");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytecho":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytecho");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytflanger":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytflanger");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytnightcore":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytnightcore");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytphaser":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytphaser");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytreverse":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytreverse");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytslow":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytslow");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytspeed":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytspeed");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytsubboost":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytsubboost");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytsuperslow":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytsuperslow");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytsuperspeed":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytsuperspeed");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytsurround":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytsurround");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytvaporwave":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytvaporwave");
      куяєвσт(νℓкуяє, vcнaт);
      break;
    case "ytvibrato":
      куяєвσт = require("../Plugins/𝘠𝘰𝘶𝘛𝘶𝘣𝘦⭕𝘑𝘴/ytvibrato");
      куяєвσт(νℓкуяє, vcнaт);
      break;

    default:
      νℓкуяє.sendMessage(
        vcнaт.chat,
        {
          text: "❗No Such Command Found.\n*⧪Press:* https://krykenz.github.io/Vlkyre",
        },
        { quoted: vcнaт }
      );
      break;
  }
};
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє куяєвσт ву кяyкєηz ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
/*
╔⧉༻ [ 𝐕𝐥𝐤𝐲𝐫𝐞🕊️𝐌𝐮𝐥𝐭𝐢𝐃𝐞𝐯𝐢𝐜𝐞 𝐀𝐏𝐈 ] 𝐢𝐬 𝐚 𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 𝐌𝐮𝐥𝐭𝐢𝐏𝐮𝐫𝐩𝐨𝐬𝐞-𝐔𝐬𝐞𝐫𝐛𝐨𝐭 𝐰𝐢𝐭𝐡 𝐌𝐨𝐝𝐞𝐫𝐚𝐭𝐢𝐨𝐧,𝐀𝐮𝐭𝐨𝐦𝐚𝐭𝐢𝐨𝐧 𝐚𝐧𝐝 𝟏𝟎𝟎+ 𝐦𝐨𝐫𝐞 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐬! 
║ 🐞𝐃𝐞𝐯𝐞𝐥𝐨𝐩𝐞𝐫𝐬 +918436686758,917430922909
║ 
║ We won't be responsible for any kind of ban due to this bot.
║ νℓкуяє was made for fun purpose and to make group management easier.
║ It's your concern if you spam and gets your account banned.
║ Also, Forks won't be entertained.
║ If you fork this repo and edit plugins, it's your concern for further updates.
║ Forking Repo is fine. But if you edit something we will not provide any help.
║ In short, Fork At Your Own Risk.
╚════════════╝
*/
("◎☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱[ νℓкуяє куяєвσт ву кяyкєηz ]☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱☱◎");
